package kr.gudi;

public class Test {

	/*****************************************************************************
	 * java 파일 사용법 3가지 조건
	 * 1. 클래스당 파일 1개
	 * 2. 파일명과 클래스명은 동일해야한다. (대소문자 구분)
	 * 3. 항상 작성하는 코드는 클래스 속에 만들다. 단, 외부 코드나 package는 밖에 있을 수 있다.
	 * 
	 * 프로그램 시작은?
	 * 1. main 매소드 (함수)가 존재 해야 한다.
	 * 2. main 매소드가 규칙이 있고 형태는 아래와 같다.
	 *  >> public static 		void 		main	(String[] args) {	  }
	 *     공유        메모리에 등록한다. 결과값이 없다. 매소드명	입력받는 변수		기능 정의
	 * 3. main 매소드명은 변경이 불가하다.
	 * 4. main 매소드 실행 시 입력 받은 변수가 존재 해야 한다.
	 *****************************************************************************/
	
	public static void main(String[] args) {
		System.out.println("안녕하세요.");
	}
	
}
